src/Reports/ОтчётПоЯчейкамКомплектации/ОтчётПоЯчейкамКомплектации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчётПоЯчейкамКомплектации</name>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
</mdclass:Report>

src/InformationRegisters/ЯчейкиКомплектации/ЯчейкиКомплектации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЯчейкиКомплектации</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КоличествоЯчеек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВЯчейке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТочкаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГруппаРасчёта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МПЗ</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.Материалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Reports/ОтчётПоЯчейкамКомплектации/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();
СписокМестХранения.Очистить();
СписокМПЗ.Очистить();

Запрос = Новый Запрос;

Запрос.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	РегистрСведений.СтатусыМПЗ.СрезПоследних(&НаДату, ) КАК СтатусыМПЗСрезПоследних
	|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО СтатусыМПЗСрезПоследних.МПЗ = Номенклатура.Ссылка
	|ГДЕ
	|	Номенклатура.Канбан.Подразделение = &Подразделение
	|	И Номенклатура.Канбан В(&СписокВидовКанбанов)
	|	И СтатусыМПЗСрезПоследних.Статус <> &Статус
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура.Наименование";
Запрос.УстановитьПараметр("Подразделение", Отчет.Подразделение);
Запрос.УстановитьПараметр("СписокВидовКанбанов", СписокВидовКанбанов);
Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыСпецификаций.Запрещённая);
Запрос.УстановитьПараметр("НаДату", ТекущаяДата());
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокМПЗ.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
		Если СписокМПЗ.Количество() = 0 Тогда
		Сообщить("Не найдено ни одного канбана по выбранным условиям!");
		Возврат;
		КонецЕсли;

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет"); 
ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");	
ОблШапкаМестоХранения1 = Макет.ПолучитьОбласть("Шапка|МестоХранения1");
ОблШапкаМестоХранения2 = Макет.ПолучитьОбласть("Шапка|МестоХранения2");
ОблМПЗОбщие = Макет.ПолучитьОбласть("МПЗ|Общие");	
ОблМПЗМестоХранения1 = Макет.ПолучитьОбласть("МПЗ|МестоХранения1");
ОблМПЗМестоХранения2 = Макет.ПолучитьОбласть("МПЗ|МестоХранения2");
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");	
ОблКонецМестоХранения1 = Макет.ПолучитьОбласть("Конец|МестоХранения1");
ОблКонецМестоХранения2 = Макет.ПолучитьОбласть("Конец|МестоХранения2");

Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Линейки.МестоХраненияКанбанов
	|ИЗ
	|	Справочник.Линейки КАК Линейки
	|ГДЕ
	|	Линейки.МестоХраненияКанбанов.ЭтоГруппа = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Линейки.МестоХраненияКанбанов.Наименование";
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СписокМестХранения.Добавить(ВыборкаДетальныеЗаписи.МестоХраненияКанбанов);
	КонецЦикла;

Чётная = Ложь;
ОблШапкаОбщие.Параметры.Подразделение = Отчет.Подразделение;
ТабДок.Вывести(ОблШапкаОбщие);
	Для каждого МестоХранения Из СписокМестХранения Цикл
		Если Чётная Тогда
		ОблШапкаМестоХранения1.Параметры.МестоХранения = МестоХранения.Значение;
		ТабДок.Присоединить(ОблШапкаМестоХранения1);
		Чётная = Ложь;
	    Иначе
		ОблШапкаМестоХранения2.Параметры.МестоХранения = МестоХранения.Значение;
		ТабДок.Присоединить(ОблШапкаМестоХранения2);
		Чётная = Истина;
		КонецЕсли;	
	КонецЦикла; 

Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЯчейкиКомплектацииСрезПоследних.МестоХранения КАК МестоХранения,
	|	ЯчейкиКомплектацииСрезПоследних.МПЗ КАК МПЗ,
	|	ЯчейкиКомплектацииСрезПоследних.КоличествоЯчеек,
	|	ЯчейкиКомплектацииСрезПоследних.КоличествоВЯчейке
	|ИЗ
	|	РегистрСведений.ЯчейкиКомплектации.СрезПоследних КАК ЯчейкиКомплектацииСрезПоследних
	|ГДЕ
	|	ЯчейкиКомплектацииСрезПоследних.МПЗ В(&СписокМПЗ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	МПЗ,
	|	МестоХранения";
Запрос.УстановитьПараметр("СписокМПЗ", СписокМПЗ);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Для каждого МПЗ Из СписокМПЗ Цикл
	Статусы = РегистрыСведений.СтатусыМПЗ.ПолучитьПоследнее(ТекущаяДата(),Новый Структура("МПЗ",МПЗ.Значение));
	ОблМПЗОбщие.Параметры.Статус = Статусы.Статус;
	ОблМПЗОбщие.Параметры.МПЗ = МПЗ.Значение;
	ОблМПЗОбщие.Параметры.ВидКанбана = МПЗ.Значение.Канбан;
	Чётная = Ложь;
	ТабДок.Вывести(ОблМПЗОбщие);
		Для каждого МестоХранения Из СписокМестХранения Цикл
		ВыборкаДетальныеЗаписи.Сбросить();
			Если ВыборкаДетальныеЗаписи.НайтиСледующий(Новый Структура("МПЗ,МестоХранения",МПЗ.Значение,МестоХранения.Значение)) Тогда
			КолЯчеек = ВыборкаДетальныеЗаписи.КоличествоЯчеек;
			КолВЯчейке = ВыборкаДетальныеЗаписи.КоличествоВЯчейке;		
			Иначе
			КолЯчеек = 0;
			КолВЯчейке = 0;
			КонецЕсли;
				Если Чётная Тогда
				ОблМПЗМестоХранения1.Параметры.КолЯчеек = КолЯчеек;
				ОблМПЗМестоХранения1.Параметры.КолВЯчейке = КолВЯчейке;
				ТабДок.Присоединить(ОблМПЗМестоХранения1);
				Чётная = Ложь;
			    Иначе
				ОблМПЗМестоХранения2.Параметры.КолЯчеек = КолЯчеек;
				ОблМПЗМестоХранения2.Параметры.КолВЯчейке = КолВЯчейке;
				ТабДок.Присоединить(ОблМПЗМестоХранения2);
				Чётная = Истина;
				КонецЕсли;
		КонецЦикла;
	КонецЦикла; 
Чётная = Ложь;
ТабДок.Вывести(ОблКонецОбщие);
	Для каждого МестоХранения Из СписокМестХранения Цикл
		Если Чётная Тогда
		ТабДок.Присоединить(ОблКонецМестоХранения1);
		Чётная = Ложь;
	    Иначе
		ТабДок.Присоединить(ОблКонецМестоХранения2);
		Чётная = Истина;
		КонецЕсли;	
	КонецЦикла; 
ТабДок.ФиксацияСверху = 4;
ТабДок.ФиксацияСлева = 3;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	СформироватьНаСервере();
	КонецЕсли;  
КонецПроцедуры
